Repository: danielgp/db-extractor
Catalog: sources/common/DataManipulator_Locale/*/LC_MESSAGES/DataManipulator.po
Languages: it_it, ro_ro

source: {deviation_type} Deviation Number is {deviation_number} to be applied to Current index, became {index_to_apply}
it_it: Il Numero di Deviazione {deviation_type} è {deviation_number} da applicare all'indice corrente, diventato {index_to_apply}
ro_ro: Numărul Devierii {deviation_type} este {deviation_number} care trebuie aplicat indexului curent, a devenit {index_to_apply}

source: All relevant files ({files_counted}) were merged into a Pandas Data Frame
it_it: Tutti i file rilevanti ({files_counted}) sono stati uniti in una Strutura di Dati Pandas
ro_ro: Toate fișierele relevante ({files_counted}) au fost contopite într-un Cadru de Date Pandas

source: Current index has been determined to be {index_current_value}
it_it: L'indice corrente è stato determinato per essere {index_current_value}
ro_ro: Indicele curent a fost determinat a fi {index_current_value}

source: File "format" attribute has a value of "{format_value}" which is not among currently implemented values: "{implemented_file_formats}", therefore file saving is not possible
it_it: L'attributo file "format" ha un valore di "{format_value}" che non è tra i valori attualmente implementati: "{implemented_file_formats}", quindi il salvataggio del file non è possibile
ro_ro: Atributul "format" al fișierului are o valoare "{format_value}" care nu se află printre valorile implementate în prezent: "{implemented_file_formats}", prin urmare, salvarea fișierului nu este posibilă

source: File "format" attribute is mandatory in the file setting, but missing, therefore file saving is not possible
it_it: L'attributo file "formato" è obbligatorio nell'impostazione del file, ma manca, pertanto non è possibile salvare il file
ro_ro: Atributul "format" al fișierului este obligatoriu, dar acesta lipsește, prin urmare nu este posibilă salvarea fișierului

source: File format is CSV and that required a "field-delimiter" attribute with value specified, and that is missing, therefore file saving is not going to be performed
it_it: Il formato del file è CSV e che ha richiesto un attributo "field-delimiter" con valore specificato e che manca, pertanto il salvataggio del file non verrà eseguito
ro_ro: Formatul fișierului este CSV și această valoare necesită deasemenea un atribut "field-delimiter" cu o valoare specificată și care lipsește, de aceea salvarea fișierului nu va fi efectuată

source: Lower
it_it: Inferiore
ro_ro: Inferior

source: Pandas Data Frame has just been saved to file "{file_name}", considering {file_type} as file type
it_it: La Strutura di Dati Pandas è stato appena salvato nel file "{file_name}", considerando {file_type} come tipo di file
ro_ro: Cadru de Date Pandas tocmai a fost salvat în fișierul "{file_name}", considerând {file_type} ca tip de fișier

source: Query expression to apply is: {query_expression}
it_it: L'espressione di interrogazione da applicare è
ro_ro: Expresia de interogare de aplicat este: {query_expression}

source: Upper
it_it: Superiore
ro_ro: Superior

source: Will retain only values {filter_type} "{filter_values}" within the field "{column_to_filter}"
it_it: Manterrò solo i valori {filter_type} "{filter_values}" all'interno del campo "{column_to_filter}"
ro_ro: Se vor păstra doar valorile {filter_type} "{filter_values}" în câmpul "{column_to_filter}"

source: different than
it_it: diverso da
ro_ro: diferit de

source: equal with
it_it: uguale a
ro_ro: eqal cu

source: matching any of these values
it_it: abbinando uno di questi valori
ro_ro: potrivire cu oricare dintre aceste valori
